Revit 2027 API
BalusterPattern.DistributionJustification Property
 Determines how baluster pattern distribution is justified.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PatternJustification DistributionJustification { get; set; }
Public Property DistributionJustification As PatternJustification
	Get
	Set
public:
property PatternJustification DistributionJustification {
	PatternJustification get ();
	void set (PatternJustification value);
}
member DistributionJustification : PatternJustification with get, set
Property Value
PatternJustification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace